{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# YAGO Queries\n",
    "\n",
    "(C) 2023-2025 by [Damir Cavar](http://damir.cavar.me/)\n",
    "\n",
    "**Version:** 2.0, September 2025\n",
    "\n",
    "**Download:** This and various other Jupyter notebooks are available from my [GitHub repo](https://github.com/dcavar/python-tutorial-for-ipython).\n",
    "\n",
    "This is a tutorial related to the L665 course on Machine Learning for NLP focusing on Deep Learning, [L645 Advanced Natural Language Processing](http://damir.cavar.me/l645/) in Fall 2023, 2025, and the L715 Seminar on Knowledge Graphs and Large Language Models at Indiana University. The following tutorial assumes that you are using a newer distribution of [Python 3.x](https://python.org/) or newer.\n",
    "\n",
    "This code contains some examples to enable [YAGO](https://yago-knowledge.org/) 4.5 queries using the remote server. [YAGO](https://yago-knowledge.org/) is a large knowledge base with general knowledge about people, cities, countries, movies, and organizations."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "from SPARQLWrapper import SPARQLWrapper, RDF, JSON, TURTLE\n",
    "import json"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Define the query object by specifying the URL to the [YAGO](https://yago-knowledge.org/) endpoint:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "sparql = SPARQLWrapper(\"https://yago-knowledge.org/sparql/query\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Specify the SPARQL query:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [],
   "source": [
    "sparql.setQuery(\"\"\"\n",
    "    PREFIX schema: <http://schema.org/>\n",
    "    PREFIX yago: <http://yago-knowledge.org/resource/>\n",
    "    PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "    PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "    SELECT * WHERE {\n",
    "        yago:Elvis_Presley  ?pred ?obj .\n",
    "    } \n",
    "    LIMIT 10\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Request the result as JSON, RDF, or TURTLE:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "sparql.setReturnFormat(JSON)\n",
    "# sparql.setReturnFormat(RDF)\n",
    "# sparql.setReturnFormat(TURTLE)\n",
    "results = sparql.query()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "data = results.convert()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'vars': ['pred', 'obj']}\n",
      "{'bindings': [{'pred': {'type': 'uri', 'value': 'http://schema.org/alternateName'}, 'obj': {'xml:lang': 'af', 'type': 'literal', 'value': 'Elvis Aaron Presley'}}, {'pred': {'type': 'uri', 'value': 'http://schema.org/alternateName'}, 'obj': {'xml:lang': 'af', 'type': 'literal', 'value': \"Koning van Rock'n'Roll\"}}, {'pred': {'type': 'uri', 'value': 'http://schema.org/alternateName'}, 'obj': {'xml:lang': 'am', 'type': 'literal', 'value': 'ኤልቭስ ፕሬስሊ'}}, {'pred': {'type': 'uri', 'value': 'http://schema.org/alternateName'}, 'obj': {'xml:lang': 'an', 'type': 'literal', 'value': 'Elvis Aaron Presley'}}, {'pred': {'type': 'uri', 'value': 'http://schema.org/alternateName'}, 'obj': {'xml:lang': 'ar', 'type': 'literal', 'value': 'ألفيس بريسلي'}}, {'pred': {'type': 'uri', 'value': 'http://schema.org/alternateName'}, 'obj': {'xml:lang': 'ar', 'type': 'literal', 'value': 'الفيس بريسلي'}}, {'pred': {'type': 'uri', 'value': 'http://schema.org/alternateName'}, 'obj': {'xml:lang': 'ast', 'type': 'literal', 'value': 'Elvis A. Presley'}}, {'pred': {'type': 'uri', 'value': 'http://schema.org/alternateName'}, 'obj': {'xml:lang': 'ast', 'type': 'literal', 'value': 'Elvis Aaron Presley'}}, {'pred': {'type': 'uri', 'value': 'http://schema.org/alternateName'}, 'obj': {'xml:lang': 'az', 'type': 'literal', 'value': 'Elvis Presley'}}, {'pred': {'type': 'uri', 'value': 'http://schema.org/alternateName'}, 'obj': {'xml:lang': 'bg', 'type': 'literal', 'value': 'Кралят на рокендрола'}}]}\n",
      "{'pred': {'type': 'uri', 'value': 'http://schema.org/alternateName'}, 'obj': {'xml:lang': 'af', 'type': 'literal', 'value': 'Elvis Aaron Presley'}}\n",
      "{'pred': {'type': 'uri', 'value': 'http://schema.org/alternateName'}, 'obj': {'xml:lang': 'af', 'type': 'literal', 'value': \"Koning van Rock'n'Roll\"}}\n",
      "{'pred': {'type': 'uri', 'value': 'http://schema.org/alternateName'}, 'obj': {'xml:lang': 'am', 'type': 'literal', 'value': 'ኤልቭስ ፕሬስሊ'}}\n",
      "{'pred': {'type': 'uri', 'value': 'http://schema.org/alternateName'}, 'obj': {'xml:lang': 'an', 'type': 'literal', 'value': 'Elvis Aaron Presley'}}\n",
      "{'pred': {'type': 'uri', 'value': 'http://schema.org/alternateName'}, 'obj': {'xml:lang': 'ar', 'type': 'literal', 'value': 'ألفيس بريسلي'}}\n",
      "{'pred': {'type': 'uri', 'value': 'http://schema.org/alternateName'}, 'obj': {'xml:lang': 'ar', 'type': 'literal', 'value': 'الفيس بريسلي'}}\n",
      "{'pred': {'type': 'uri', 'value': 'http://schema.org/alternateName'}, 'obj': {'xml:lang': 'ast', 'type': 'literal', 'value': 'Elvis A. Presley'}}\n",
      "{'pred': {'type': 'uri', 'value': 'http://schema.org/alternateName'}, 'obj': {'xml:lang': 'ast', 'type': 'literal', 'value': 'Elvis Aaron Presley'}}\n",
      "{'pred': {'type': 'uri', 'value': 'http://schema.org/alternateName'}, 'obj': {'xml:lang': 'az', 'type': 'literal', 'value': 'Elvis Presley'}}\n",
      "{'pred': {'type': 'uri', 'value': 'http://schema.org/alternateName'}, 'obj': {'xml:lang': 'bg', 'type': 'literal', 'value': 'Кралят на рокендрола'}}\n"
     ]
    }
   ],
   "source": [
    "for x in data:\n",
    "    print(data[x])\n",
    "for x in data[\"results\"][\"bindings\"]:\n",
    "    print(x)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**(C) 2023-2025 by [Damir Cavar](http://damir.cavar.me/) <<dcavar@iu.edu>>**"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
